Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.BuildEnergyAnalysisAnalyticalSystems
Builds the analytical systems and the space-zone association in the energy model.
Returns:
True if analytical spaces are assigned to zone equipment.
Since:
2020

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.StopSystemsAnalysis(System.IntPtr)
Stops the active OpenStudio analysis process.
handle:
The handle of open studio process to be stopped.
Since:
2020

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.StartSystemsAnalysis(Autodesk.Revit.DB.Document,System.String,System.String,System.String)
Starts the OpenStudio analysis of analytical systems and energy model.
document:
The document of the energy analysis detail model to be analyzed.
oswFile:
The full path of the OpenStudio OSW file.
weatherFile:
The full path of the weather file. It may be cached based on the weather station name of the project site location.
outputFolder:
The existing folder where the analysis runs. If empty or invalid path, the analysis runs in the TEMP folder.
Returns:
The handle of open studio process if successfully started, nullptr if failed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.RequestSystemsAnalysis(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Requests the systems analysis to start in the background process.
document:
The document of the energy analysis detail model to be analyzed.
idReportView:
The element id of the report view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.IsSystemsAnalysisActive(System.IntPtr)
Is the systems analysis active with open studio simulation?
handle:
The handle of open studio analysis process to be detected.
Returns:
true if the open studio process is active, false otherwise.
Since:
2020